Converted diagrams to mermaid
